Функция СформироватьДанные(Начало, Конец) Экспорт
 П = Новый Структура("Начало,Конец", Начало, КонецДня(Конец));
 Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ ВЫБОР КОГДА Заказано = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА (ВЫБОР КОГДА ФактическиПродано = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА НоменклатураКт ИНАЧЕ ФактическиПродано КОНЕЦ) ИНАЧЕ Заказано КОНЕЦ КАК Номенклатура, ВЫБОР КОГДА ФактическиПродано = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА НоменклатураКт ИНАЧЕ ФактическиПродано КОНЕЦ КАК Продано,
 | СУММА(ВЫБОР КОГДА СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Товары) ТОГДА КоличествоКт ИНАЧЕ 0 КОНЕЦ) КАК Количество,
 | СУММА(ВЫБОР КОГДА СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Товары) ТОГДА Сумма ИНАЧЕ 0 КОНЕЦ) КАК Себестоимость,
 | СУММА(ВЫБОР КОГДА СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели) ТОГДА Сумма ИНАЧЕ 0 КОНЕЦ) КАК Продажа,
 | СУММА(ВЫБОР КОГДА СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели) ТОГДА Сумма ИНАЧЕ -Сумма КОНЕЦ) КАК Прибыль
 | ИЗ РегистрБухгалтерии.Хозрасчетный
 | ГДЕ Активность И Период МЕЖДУ &Начало И &Конец
 | И ((СчетДт=ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибылиУбытки) И СчетКт=ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Товары))
 | ИЛИ (СчетДт=ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели) И СчетКт=ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибылиУбытки)))
 | СГРУППИРОВАТЬ ПО ВЫБОР КОГДА Заказано = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА (ВЫБОР КОГДА ФактическиПродано = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА НоменклатураКт ИНАЧЕ ФактическиПродано КОНЕЦ) ИНАЧЕ Заказано КОНЕЦ, ВЫБОР КОГДА ФактическиПродано = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА НоменклатураКт ИНАЧЕ ФактическиПродано КОНЕЦ УПОРЯДОЧИТЬ ПО Номенклатура, Продано",П);
КонецФункции
