Функция СформироватьТаблицу(Начало, Конец) Экспорт
    Начало = НачалоМесяца(Начало); Конец = КонецМесяца(Начало);
    Возврат УчетСервер.ТаблицаЗапроса("ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент,
    |СУММА(Результат) КАК СуммаПремии
    |ИЗ РегистрРасчета.Начисления ГДЕ ПериодРегистрации МЕЖДУ &Начало И &Конец
    |И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Премия)
    |СГРУППИРОВАТЬ ПО Сотрудник", Новый Структура("Начало, Конец", Начало, Конец));
КонецФункции
