&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса()); КонецПериода = КонецМесяца(НачалоПериода);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    НачалоПериода = НачалоМесяца(НачалоПериода); КонецПериода = КонецМесяца(НачалоПериода);
    Данные = Отчеты.Премии.СформироватьТаблицу(НачалоДня(НачалоПериода), КонецДня(КонецПериода));
    Результат = УчетСервер.ТабличныйОтчет(Данные, "Премии", НачалоПериода, КонецПериода);
КонецПроцедуры
