Процедура ОбработкаПроведения(Отказ, РежимПроведения)
 Если Проводки.Количество()=0 Тогда ВызватьИсключение "Введите проводки операции"; КонецЕсли;
 УчетСервер.ПодготовитьБУ(ЭтотОбъект);
 Для Каждого С Из Проводки Цикл
  Если Не ЗначениеЗаполнено(С.СчетДт) Или Не ЗначениеЗаполнено(С.СчетКт) Тогда ВызватьИсключение "Заполните корреспонденцию счетов"; КонецЕсли;
  Д = Движения.Хозрасчетный.Добавить(); ЗаполнитьЗначенияСвойств(Д, С); Д.Период = Дата; Д.ФактическиПродано = С.НоменклатураКт;
  Если Не С.СчетДт.КоличественныйУчет Тогда Д.НоменклатураДт = Справочники.Номенклатура.ПустаяСсылка(); Д.КоличествоДт = 0; КонецЕсли;
  Если Не С.СчетКт.КоличественныйУчет Тогда Д.НоменклатураКт = Справочники.Номенклатура.ПустаяСсылка(); Д.КоличествоКт = 0; КонецЕсли;
  Если С.СчетДт = ПланыСчетов.Управленческий.Товары Тогда Д.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = С.СкладДт; КонецЕсли;
  Если С.СчетКт = ПланыСчетов.Управленческий.Товары Тогда Д.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = С.СкладКт; КонецЕсли;
 КонецЦикла;
КонецПроцедуры
