&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДата()); КонецПериода = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Если НачалоПериода > КонецПериода Тогда ВызватьИсключение "Начало периода позже окончания."; КонецЕсли;
    Данные = Отчеты.ПродажиИАналоги.СформироватьДанные(НачалоПериода, КонецПериода);
    Заголовок = "Продажи товаров и аналогов: " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " — " + Формат(КонецПериода, "ДФ=dd.MM.yyyy");
    Результат = ОтчетыСервер.ПредставитьОтчет(Данные, Заголовок, "ПродажиБУ");
КонецПроцедуры

