Функция СформироватьДанные(Начало, Конец) Экспорт
 Если НачалоМесяца(Начало) <> НачалоМесяца(Конец) Тогда ВызватьИсключение "Отчет формируется за один календарный месяц"; КонецЕсли;
 Начало = НачалоМесяца(Начало); Конец = КонецМесяца(Начало);
 П = Новый Структура("Начало,Конец", Начало, КонецДня(Конец));
 Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент, СУММА(Результат) КАК СуммаПремии
 | ИЗ РегистрРасчета.Начисления
 | ГДЕ Активность И ПериодДействияНачало МЕЖДУ &Начало И &Конец
 | И ВидРасчета=ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Премия)
 | СГРУППИРОВАТЬ ПО Сотрудник УПОРЯДОЧИТЬ ПО Сотрудник.Наименование",П);
КонецФункции
