Функция Сформировать(Знач НачалоПериода, Знач КонецПериода) Экспорт
    Виды = Новый Массив; Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Заказано); Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Продано);
    КорСчета = Новый Массив; КорСчета.Добавить(ПланыСчетов.Управленческий.Товары); КорСчета.Добавить(ПланыСчетов.Управленческий.Покупатели);
    Возврат Учет.ЗапросТаблица("ВЫБРАТЬ Номенклатура, Продано, Количество, Себестоимость, Выручка, Выручка - Себестоимость КАК Прибыль ИЗ
    | (ВЫБРАТЬ Субконто1 КАК Номенклатура, Субконто2 КАК Продано,
    | СУММА(ВЫБОР КОГДА КорСчет = &Товары ТОГДА КоличествоКорОборот ИНАЧЕ 0 КОНЕЦ) КАК Количество,
    | СУММА(ВЫБОР КОГДА КорСчет = &Товары ТОГДА СуммаОборот ИНАЧЕ 0 КОНЕЦ) КАК Себестоимость,
    | СУММА(ВЫБОР КОГДА КорСчет = &Покупатели ТОГДА -СуммаОборот ИНАЧЕ 0 КОНЕЦ) КАК Выручка
    | ИЗ РегистрБухгалтерии.Хозрасчетный.Обороты(&Начало, &Конец, , Счет = &Счет, &Виды,
    | Субконто1 <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка), КорСчет В (&КорСчета))
    | СГРУППИРОВАТЬ ПО Субконто1, Субконто2) КАК Продажи
    | УПОРЯДОЧИТЬ ПО Номенклатура, Продано",
    Новый Структура("Начало,Конец,Счет,Виды,КорСчета,Товары,Покупатели", НачалоДня(НачалоПериода), КонецДня(КонецПериода), ПланыСчетов.Управленческий.ПрибылиУбытки, Виды, КорСчета, ПланыСчетов.Управленческий.Товары, ПланыСчетов.Управленческий.Покупатели));
КонецФункции
