
Функция Сформировать(Начало,Конец,Подразделение) Экспорт
    Возврат Учет.ЗапросТаблица("ВЫБРАТЬ Свойство,МАКСИМУМ(ВЫРАЗИТЬ(Значение КАК СТРОКА(150))) КАК Производитель ПОМЕСТИТЬ Производители
    |ИЗ РегистрСведений.ЗначенияСвойств ГДЕ Характеристика.Наименование=""Производитель"" СГРУППИРОВАТЬ ПО Свойство;
    |ВЫБРАТЬ Данные.Номенклатура,Данные.Свойство КАК Характеристика,ЕСТЬNULL(Производители.Производитель,Данные.Номенклатура.Производитель) КАК Производитель,
    |СУММА(Данные.СтоимостьНачальныйОстаток) КАК НачальныйОстаток,СУММА(Данные.СтоимостьПриход) КАК Приход,СУММА(Данные.СтоимостьРасход) КАК Расход,СУММА(Данные.СтоимостьКонечныйОстаток) КАК КонечныйОстаток,
    |СУММА(Данные.КоличествоНачальныйОстаток) КАК НачальноеКоличество,СУММА(Данные.КоличествоПриход) КАК ПриходКоличество,СУММА(Данные.КоличествоРасход) КАК РасходКоличество,СУММА(Данные.КоличествоКонечныйОстаток) КАК КонечноеКоличество
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало,&Конец,Период,,Подразделение=&Подразделение) КАК Данные
    |ЛЕВОЕ СОЕДИНЕНИЕ Производители ПО Данные.Свойство=Производители.Свойство
    |СГРУППИРОВАТЬ ПО Данные.Номенклатура,Данные.Свойство,ЕСТЬNULL(Производители.Производитель,Данные.Номенклатура.Производитель)
    |УПОРЯДОЧИТЬ ПО Производитель,Номенклатура,Характеристика",Новый Структура("Начало,Конец,Подразделение",Начало,КонецДня(Конец),Подразделение));
КонецФункции
