&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
 Начало = НачалоМесяца(ТекущаяДата()); Конец = КонецМесяца(Начало);
КонецПроцедуры
&НаКлиенте
Процедура Сформировать(Команда)
 СформироватьНаСервере();
КонецПроцедуры
&НаСервере
Процедура СформироватьНаСервере() Экспорт
 Таблица = Отчеты.ВедомостьПоПодразделению.СформироватьДанные(Начало, Конец, Подразделение);
 Результат = УчетСервер.ПечатныйОтчет(Таблица,"ВедомостьПоПодразделению",Начало,Конец,Подразделение);
КонецПроцедуры
