Функция Сформировать(НачалоПериода, КонецПериода, Подразделение, ВидХарактеристики = Неопределено) Экспорт
    Если ВидХарактеристики = Неопределено Или Не ЗначениеЗаполнено(ВидХарактеристики) Тогда
        Поиск = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Характеристика ИЗ РегистрСведений.ЗначенияСвойств УПОРЯДОЧИТЬ ПО ВЫБОР КОГДА Характеристика.Наименование = ""Производитель"" ТОГДА 0 ИНАЧЕ 1 КОНЕЦ, Характеристика.Наименование");
        Выборка = Поиск.Выполнить().Выбрать();
        ВидХарактеристики = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка();
        Если Выборка.Следующий() Тогда ВидХарактеристики = Выборка.Характеристика; КонецЕсли;
    КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ О.Номенклатура, О.Свойство,
    | ЕСТЬNULL(З.Значение, О.Свойство) КАК Характеристика,
    | СУММА(О.КоличествоНачальныйОстаток) КАК НачальноеКоличество,
    | СУММА(О.КоличествоПриход) КАК ПриходКоличество,
    | СУММА(О.КоличествоРасход) КАК РасходКоличество,
    | СУММА(О.КоличествоКонечныйОстаток) КАК КонечноеКоличество,
    | СУММА(О.СтоимостьНачальныйОстаток) КАК НачальныйОстаток,
    | СУММА(О.СтоимостьПриход) КАК Приход,
    | СУММА(О.СтоимостьРасход) КАК Расход,
    | СУММА(О.СтоимостьКонечныйОстаток) КАК КонечныйОстаток
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК О
    |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК З ПО О.Свойство = З.Свойство И З.Характеристика = &Характеристика
    |СГРУППИРОВАТЬ ПО О.Номенклатура, О.Свойство, ЕСТЬNULL(З.Значение, О.Свойство)
    |УПОРЯДОЧИТЬ ПО Характеристика, Номенклатура");
    Запрос.УстановитьПараметр("Начало", НачалоДня(НачалоПериода)); Запрос.УстановитьПараметр("Конец", КонецДня(КонецПериода));
    Запрос.УстановитьПараметр("Подразделение", Подразделение);
    Запрос.УстановитьПараметр("Характеристика", ВидХарактеристики);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

