Функция СформироватьДанные(Начало, Конец, Подразделение) Экспорт
 П = Новый Структура("Начало,Конец,Подразделение",Начало,КонецДня(Конец),Подразделение);
 Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Ост.Номенклатура, Ост.Характеристика,
 |ЕСТЬNULL(Свойства.Производитель, ""Без производителя"") КАК Производитель,
 |Ост.НачКоличество, Ост.НачОстаток, Ост.ПриходКоличество, Ост.Приход, Ост.РасходКоличество, Ост.Расход, Ост.КонКоличество, Ост.КонОстаток
 |ИЗ (ВЫБРАТЬ Номенклатура, Свойство КАК Характеристика,
 |СУММА(КоличествоНачальныйОстаток) КАК НачКоличество, СУММА(СтоимостьНачальныйОстаток) КАК НачОстаток,
 |СУММА(КоличествоПриход) КАК ПриходКоличество, СУММА(СтоимостьПриход) КАК Приход,
 |СУММА(КоличествоРасход) КАК РасходКоличество, СУММА(СтоимостьРасход) КАК Расход,
 |СУММА(КоличествоКонечныйОстаток) КАК КонКоличество, СУММА(СтоимостьКонечныйОстаток) КАК КонОстаток
 |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало,&Конец,Авто,,Подразделение=&Подразделение)
 |СГРУППИРОВАТЬ ПО Номенклатура, Свойство) КАК Ост
 |ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ Свойство, МАКСИМУМ(ВЫРАЗИТЬ(Значение КАК СТРОКА(150))) КАК Производитель
 |ИЗ РегистрСведений.ЗначенияСвойств ГДЕ Характеристика.Наименование = &Производитель
 |СГРУППИРОВАТЬ ПО Свойство) КАК Свойства ПО Ост.Характеристика = Свойства.Свойство
 |УПОРЯДОЧИТЬ ПО Производитель, Ост.Номенклатура.Наименование, Ост.Характеристика",ПараметрыВедомости(П));
КонецФункции
Функция ПараметрыВедомости(П)
 П.Вставить("Производитель","Производитель"); Возврат П;
КонецФункции



