&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДата()); КонецПериода = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Если НачалоПериода > КонецПериода Тогда ВызватьИсключение "Начало периода позже окончания."; КонецЕсли;
    Данные = Отчеты.ВедомостьПоПодразделению.СформироватьДанные(НачалоПериода, КонецПериода, Подразделение);
    Заголовок = "Ведомость по подразделению " + Строка(Подразделение) + " с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy");
    Результат = ОтчетыСервер.ПредставитьОтчет(Данные, Заголовок, "Ведомость");
КонецПроцедуры
