Функция Сформировать(НачалоПериода, КонецПериода) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ Номенклатура, СУММА(КоличествоОборот) КАК Количество,
    |СУММА(СебестоимостьОборот) КАК Себестоимость, СУММА(ВыручкаОборот) КАК Продажа,
    |СУММА(ВыручкаОборот - СебестоимостьОборот) КАК Прибыль
    |ИЗ РегистрНакопления.Продажи.Обороты(&Начало, &Конец, , )
    |СГРУППИРОВАТЬ ПО Номенклатура УПОРЯДОЧИТЬ ПО Номенклатура");
    Запрос.УстановитьПараметр("Начало", НачалоДня(НачалоПериода)); Запрос.УстановитьПараметр("Конец", КонецДня(КонецПериода));
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

