#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса()); КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Если НачалоПериода > КонецПериода Тогда ВызватьИсключение "Начало периода позже окончания"; КонецЕсли;
    Данные = Отчеты.ПродажиОперативные.Сформировать(НачалоПериода, КонецПериода);
    Результат.Очистить();
    Заголовок = "Продажи с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy");
    Результат.Область(1, 1, 1, 5).Объединить();
    Результат.Область(1, 1).Текст = Заголовок;
    Результат.Область(1, 1).Шрифт = Новый Шрифт(, 12, Истина);
    Заголовки = СтрРазделить("Номенклатура|Количество|Себестоимость|Продажа|Прибыль", "|");
    Для Индекс = 0 По Заголовки.Количество() - 1 Цикл
        Результат.Область(3, Индекс + 1).Текст = Заголовки[Индекс];
        Результат.Область(3, Индекс + 1).Шрифт = Новый Шрифт(, , Истина);
        Результат.Область(3, Индекс + 1).ШиринаКолонки = ?(Индекс < 1, 25, 17);
    КонецЦикла;
    СтрокаВывода = 4;
    
    Для Каждого Стр Из Данные Цикл
        
        Результат.Область(СтрокаВывода, 1).Текст = Строка(Стр.Номенклатура);
Результат.Область(СтрокаВывода, 2).Текст = Строка(Стр.Количество);
Результат.Область(СтрокаВывода, 3).Текст = Строка(Стр.Себестоимость);
Результат.Область(СтрокаВывода, 4).Текст = Строка(Стр.Продажа);
Результат.Область(СтрокаВывода, 5).Текст = Строка(Стр.Прибыль);

        СтрокаВывода = СтрокаВывода + 1;
    КонецЦикла;
    Результат.Область(СтрокаВывода, 1).Текст = "ИТОГО";Результат.Область(СтрокаВывода, 2).Текст = Строка(Данные.Итог("Количество"));Результат.Область(СтрокаВывода, 3).Текст = Строка(Данные.Итог("Себестоимость"));Результат.Область(СтрокаВывода, 4).Текст = Строка(Данные.Итог("Продажа"));Результат.Область(СтрокаВывода, 5).Текст = Строка(Данные.Итог("Прибыль"));
    Результат.АвтоМасштаб = Истина;
    Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
    Для НомерСтроки = 3 По СтрокаВывода Цикл
        Для НомерКолонки = 1 По 5 Цикл
            Результат.Область(НомерСтроки, НомерКолонки).Обвести(Линия, Линия, Линия, Линия);
        КонецЦикла;
    КонецЦикла;
    Результат.Область(СтрокаВывода, 1, СтрокаВывода, 5).Шрифт = Новый Шрифт(, , Истина);
КонецПроцедуры

