&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса()); КонецПериода = КонецМесяца(НачалоПериода);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Данные = Отчеты.Ведомость.СформироватьТаблицу(НачалоДня(НачалоПериода), КонецДня(КонецПериода), Подразделение);
    Результат = УчетСервер.ТабличныйОтчет(Данные, "Ведомость", НачалоПериода, КонецПериода);
КонецПроцедуры
