Функция Сформировать(Начало, Конец) Экспорт
    П=Новый Структура("Начало,Конец",НачалоДня(Начало),КонецДня(Конец));
    
    Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Номенклатура, СУММА(КоличествоОборот) КАК Количество, СУММА(СебестоимостьОборот) КАК Себестоимость, СУММА(ВыручкаОборот) КАК Выручка, СУММА(ВыручкаОборот-СебестоимостьОборот) КАК Прибыль ИЗ РегистрНакопления.ПродажиОУ.Обороты(&Начало,&Конец,,) СГРУППИРОВАТЬ ПО Номенклатура УПОРЯДОЧИТЬ ПО Номенклатура.Наименование",П);
КонецФункции

Функция ПечатнаяФорма(Начало,Конец) Экспорт
    Данные=Сформировать(Начало,Конец);
    Возврат ОтчетыСервер.ПечатнаяФорма("ou_sales",Данные,Начало,Конец);
КонецФункции
