Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Попытка
        УчетСервер.Сборка(ЭтотОбъект);
    Исключение
        Отказ = Истина;
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = ОписаниеОшибки();
        Сообщение.Сообщить();
    КонецПопытки;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    Попытка
        УчетСервер.ОтменитьТоварныйДокумент(ЭтотОбъект, Истина, Ложь);
    Исключение
        Отказ = Истина;
        Сообщение = Новый СообщениеПользователю; Сообщение.Текст = ОписаниеОшибки(); Сообщение.Сообщить();
    КонецПопытки;
КонецПроцедуры
