Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Движения.ОстаткиПартий.Записывать=Истина;
    Движения.ОстаткиНоменклатуры.Записывать=Истина;
    Движения.УправленческийУчет.Записывать=Истина;
    Движения.ПродажиОУ.Записывать=Истина;
    Движения.ПродажиБУ.Записывать=Истина;
    Если ОперативныйУчет Тогда УчетСервер.БлокироватьОУ();КонецЕсли;
    УчетСервер.Приход(ЭтотОбъект, Отказ);
    Если ОперативныйУчет И Не Отказ Тогда УчетСервер.ЗаписатьОстаткиОУ(ЭтотОбъект,Отказ);КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    ОперативныйУчет=Ложь;
    БухгалтерскийУчет=Ложь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если Не ОперативныйУчет И Не БухгалтерскийУчет Тогда
        БухгалтерскийУчет=ЗначениеЗаполнено(Склад);
        ОперативныйУчет=ЗначениеЗаполнено(Подразделение);
        Если Не ОперативныйУчет Тогда
            Для Каждого Стр Из СписокНоменклатуры Цикл
                Если ЗначениеЗаполнено(Стр.Подразделение) Тогда ОперативныйУчет=Истина;Прервать;КонецЕсли;
            КонецЦикла;
        КонецЕсли;
    КонецЕсли;
    СуммаПоДокументу=0;
    Для Каждого С Из СписокНоменклатуры Цикл
        Если С.Сумма=0 Тогда С.Сумма=Окр(С.Количество*С.Цена,2);КонецЕсли;
        СуммаПоДокументу=СуммаПоДокументу+С.Сумма;
    КонецЦикла;
КонецПроцедуры
