Процедура ОбработкаПроведения(Отказ,РежимПроведения)
Движения.ОстаткиНоменклатуры.Очистить(); Движения.ОстаткиНоменклатуры.Записывать=Истина;
    Движения.Хозрасчетный.Очистить(); Движения.Хозрасчетный.Записывать=Истина;
    Движения.ПродажиОУ.Очистить(); Движения.ПродажиОУ.Записывать=Истина;
    ЕстьОперативный=ОперативныйУчет Или ЗначениеЗаполнено(Подразделение);
    Для Каждого Стр Из СписокНоменклатуры Цикл Если ЗначениеЗаполнено(Стр.Подразделение) Тогда ЕстьОперативный=Истина; КонецЕсли; КонецЦикла;
    Если Не ЕстьОперативный И Не ЗначениеЗаполнено(Склад) Тогда ВызватьИсключение "Укажите склад или подразделение"; КонецЕсли;
    Если ЕстьОперативный Тогда Учет.ПродажаОУ(ЭтотОбъект); КонецЕсли;
    Если ЗначениеЗаполнено(Склад) Тогда Учет.ПродажаБУ(ЭтотОбъект); КонецЕсли;
КонецПроцедуры
