Функция Сформировать(Знач НачалоПериода, Знач КонецПериода) Экспорт
    Если НачалоМесяца(НачалоПериода) <> НачалоМесяца(КонецПериода) Тогда ВызватьИсключение "Отчет строится за один календарный месяц"; КонецЕсли;
    Возврат Учет.ЗапросТаблица("ВЫБРАТЬ Сотрудник, Стаж, Процент, СУММА(Результат) КАК Сумма
    | ИЗ РегистрРасчета.Начисления
    | ГДЕ Активность И ПериодДействия МЕЖДУ &Начало И &Конец
    | И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Премия)
    | СГРУППИРОВАТЬ ПО Сотрудник, Стаж, Процент УПОРЯДОЧИТЬ ПО Сотрудник",
    Новый Структура("Начало,Конец", НачалоМесяца(НачалоПериода), КонецМесяца(КонецПериода)));
КонецФункции
