Функция СформироватьДанные(Начало, Конец) Экспорт
 П = Новый Структура("Начало,Конец", Начало, КонецДня(Конец));
 Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Номенклатура, СУММА(КоличествоОборот) КАК Количество,
 | СУММА(СебестоимостьОборот) КАК Себестоимость, СУММА(ВыручкаОборот) КАК Продажа,
 | СУММА(ВыручкаОборот-СебестоимостьОборот) КАК Прибыль
 | ИЗ РегистрНакопления.Продажи.Обороты(&Начало,&Конец,,)
 | СГРУППИРОВАТЬ ПО Номенклатура УПОРЯДОЧИТЬ ПО Номенклатура.Наименование",П);
КонецФункции
