&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДата()); КонецПериода = КонецМесяца(ТекущаяДата());
КонецПроцедуры
&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры
&НаСервере
Процедура СформироватьНаСервере()
    Отчет = РеквизитФормыВЗначение("Объект");
    Таблица = Отчет.Сформировать(НачалоПериода, КонецПериода);
    Результат.Очистить();
    Учет.ВывестиОтчет(Результат, Таблица, "Премии", НачалоПериода, КонецПериода);
КонецПроцедуры
