Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Движения.Хозрасчетный.Очистить(); Движения.Хозрасчетный.Записывать=Истина;
    Учет.НастроитьСчета();
    Учет.Блокировать("РегистрБухгалтерии.Хозрасчетный");
    Движения.Хозрасчетный.Записывать=Истина;
    Для Каждого Стр Из Проводки Цикл
        Если Не ЗначениеЗаполнено(Стр.СчетДт) Или Не ЗначениеЗаполнено(Стр.СчетКт) Тогда ВызватьИсключение "Укажите оба счета"; КонецЕсли;
        Д=Движения.Хозрасчетный.Добавить(); ЗаполнитьЗначенияСвойств(Д,Стр); Д.Период=Дата;
        Если ЗначениеЗаполнено(Стр.СкладДт) Тогда Д.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады]=Стр.СкладДт; КонецЕсли;
        Если ЗначениеЗаполнено(Стр.СкладКт) Тогда Д.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады]=Стр.СкладКт; КонецЕсли;
    КонецЦикла;
КонецПроцедуры
