Функция Сформировать(Начало, Конец) Экспорт
    П=Новый Структура("Начало,Конец",НачалоДня(Начало),КонецДня(Конец));
    П.Начало=НачалоМесяца(Начало);П.Конец=КонецМесяца(Начало);
    Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент, СУММА(Результат) КАК СуммаПремии ИЗ РегистрРасчета.Начисления ГДЕ ПериодДействияНачало МЕЖДУ &Начало И &Конец И ВидРасчета=ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Премия) СГРУППИРОВАТЬ ПО Сотрудник УПОРЯДОЧИТЬ ПО Сотрудник.Наименование",П);
КонецФункции

Функция ПечатнаяФорма(Начало,Конец) Экспорт
    Данные=Сформировать(Начало,Конец);
    Возврат ОтчетыСервер.ПечатнаяФорма("pr_bonus",Данные,Начало,Конец);
КонецФункции
