Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Попытка
        УчетСервер.Операция(ЭтотОбъект);
    Исключение
        Отказ = Истина;
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = ОписаниеОшибки();
        Сообщение.Сообщить();
    КонецПопытки;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    Попытка
        УчетСервер.ОтменитьТоварныйДокумент(ЭтотОбъект, Ложь, Истина);
    Исключение
        Отказ = Истина;
        Сообщение = Новый СообщениеПользователю; Сообщение.Текст = ОписаниеОшибки(); Сообщение.Сообщить();
    КонецПопытки;
КонецПроцедуры
