#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    МесяцОтчета = НачалоМесяца(ТекущаяДатаСеанса());
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    
    Данные = Отчеты.Премии.Сформировать(НачалоМесяца(МесяцОтчета), КонецМесяца(МесяцОтчета));
    Результат.Очистить();
    Заголовок = "Месяц: " + Формат(МесяцОтчета, "ДФ=MMMM yyyy");
    Результат.Область(1, 1, 1, 4).Объединить();
    Результат.Область(1, 1).Текст = Заголовок;
    Результат.Область(1, 1).Шрифт = Новый Шрифт(, 12, Истина);
    Заголовки = СтрРазделить("Сотрудник|Трудовой стаж|% премии|Сумма премии", "|");
    Для Индекс = 0 По Заголовки.Количество() - 1 Цикл
        Результат.Область(3, Индекс + 1).Текст = Заголовки[Индекс];
        Результат.Область(3, Индекс + 1).Шрифт = Новый Шрифт(, , Истина);
        Результат.Область(3, Индекс + 1).ШиринаКолонки = ?(Индекс < 2, 25, 17);
    КонецЦикла;
    СтрокаВывода = 4;
    
    Для Каждого Стр Из Данные Цикл
        
        Результат.Область(СтрокаВывода, 1).Текст = Строка(Стр.Сотрудник);
Результат.Область(СтрокаВывода, 2).Текст = Строка(Цел(Стр.Стаж)) + " г. " + Строка(Окр((Стр.Стаж - Цел(Стр.Стаж)) * 12, 0)) + " мес.";
Результат.Область(СтрокаВывода, 3).Текст = Строка(Стр.Процент);
Результат.Область(СтрокаВывода, 4).Текст = Строка(Стр.СуммаПремии);

        СтрокаВывода = СтрокаВывода + 1;
    КонецЦикла;
    Результат.Область(СтрокаВывода, 1).Текст = "ИТОГО"; Результат.Область(СтрокаВывода, 4).Текст = Формат(Данные.Итог("СуммаПремии"), "ЧДЦ=2");
    Результат.АвтоМасштаб = Истина;
    Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
    Для НомерСтроки = 3 По СтрокаВывода Цикл
        Для НомерКолонки = 1 По 4 Цикл
            Результат.Область(НомерСтроки, НомерКолонки).Обвести(Линия, Линия, Линия, Линия);
        КонецЦикла;
    КонецЦикла;
    Результат.Область(СтрокаВывода, 1, СтрокаВывода, 4).Шрифт = Новый Шрифт(, , Истина);
КонецПроцедуры

