Процедура ПередЗаписью(Отказ, Замещение)
    Блоки = Новый Массив;
    Для Каждого Запись Из ЭтотОбъект Цикл
        Если Запись.Количество <= 0 Тогда Отказ = Истина; Сообщить("Количество в спецификации должно быть положительным"); Возврат; КонецЕсли;
        Если Блоки.Найти(Запись.СистемныйБлок) = Неопределено Тогда Блоки.Добавить(Запись.СистемныйБлок); КонецЕсли;
    КонецЦикла;
    Если Блоки.Количество() = 0 Тогда Возврат; КонецЕсли;
    Блокировка = Новый БлокировкаДанных;
    Элемент = Блокировка.Добавить("РегистрСведений.Спецификации");
    Элемент.Режим = РежимБлокировкиДанных.Исключительный;
    Блокировка.Заблокировать();
    Версии = УчетСервер.ТаблицаЗапроса("ВЫБРАТЬ РАЗЛИЧНЫЕ СистемныйБлок, Период ИЗ РегистрСведений.Спецификации ГДЕ СистемныйБлок В (&Блоки)", Новый Структура("Блоки", Блоки));
    Для Каждого Запись Из ЭтотОбъект Цикл
        Для Каждого Версия Из Версии Цикл
            Если Версия.СистемныйБлок = Запись.СистемныйБлок И Версия.Период <> Запись.Период И НачалоНедели(Версия.Период) = НачалоНедели(Запись.Период) Тогда
                Отказ = Истина; Сообщить("Для блока уже введена версия спецификации в этой неделе"); Возврат;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
КонецПроцедуры
