Процедура ПередЗаписью(Отказ, Замещение)
    Если Отбор.Период.Использование Тогда
        Отбор.Период.Установить(НачалоНедели(Отбор.Период.Значение));
    КонецЕсли;
    Для Каждого С Из ЭтотОбъект Цикл
        С.Период = НачалоНедели(С.Период);
        Если С.Количество <= 0 Тогда ВызватьИсключение "Количество детали в спецификации должно быть положительным"; КонецЕсли;
        Если С.Блок = С.Деталь Тогда ВызватьИсключение "Блок не может входить в собственную спецификацию"; КонецЕсли;
    КонецЦикла;
КонецПроцедуры
