Функция СформироватьТаблицу(Начало, Конец) Экспорт
    Возврат УчетСервер.ТаблицаЗапроса("ВЫБРАТЬ Номенклатура, Продано, СУММА(КоличествоОборот) КАК Количество,
    |СУММА(СебестоимостьОборот) КАК Себестоимость, СУММА(ВыручкаОборот) КАК Продажа,
    |СУММА(ВыручкаОборот - СебестоимостьОборот) КАК Прибыль
    |ИЗ РегистрНакопления.Продажи.Обороты(&Начало, &Конец, , Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
    |СГРУППИРОВАТЬ ПО Номенклатура, Продано", Новый Структура("Начало, Конец", Начало, Конец));
КонецФункции
