Функция Сформировать(Начало, Конец, Подразделение) Экспорт
    П=Новый Структура("Начало,Конец",НачалоДня(Начало),КонецДня(Конец));
    П.Вставить("Подразделение",Подразделение);
    Данные=УчетСервер.ЗапросТаблица("ВЫБРАТЬ Номенклатура, Свойство, СУММА(КоличествоНачальныйОстаток) КАК НачКоличество, СУММА(СтоимостьНачальныйОстаток) КАК НачСумма, СУММА(КоличествоПриход) КАК ПриходКоличество, СУММА(СтоимостьПриход) КАК ПриходСумма, СУММА(КоличествоРасход) КАК РасходКоличество, СУММА(СтоимостьРасход) КАК РасходСумма, СУММА(КоличествоКонечныйОстаток) КАК КонКоличество, СУММА(СтоимостьКонечныйОстаток) КАК КонСумма ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало,&Конец,,ДвиженияИГраницыПериода,Подразделение=&Подразделение) СГРУППИРОВАТЬ ПО Номенклатура,Свойство УПОРЯДОЧИТЬ ПО Свойство,Номенклатура.Наименование",П);
    ОтчетыСервер.ДобавитьХарактеристики(Данные);
    Возврат Данные;
КонецФункции

Функция ПечатнаяФорма(Начало,Конец,Подразделение) Экспорт
    Данные=Сформировать(Начало,Конец,Подразделение);
    Возврат ОтчетыСервер.ПечатнаяФорма("ou_statement",Данные,Начало,Конец,Подразделение);
КонецФункции
