Функция Сформировать(Начало, Конец) Экспорт
    П=Новый Структура("Начало,Конец",НачалоДня(Начало),КонецДня(Конец));
    
    Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Номенклатура, Продано, СУММА(КоличествоОборот) КАК Количество, СУММА(СебестоимостьОборот) КАК Себестоимость, СУММА(ВыручкаОборот) КАК Выручка, СУММА(ВыручкаОборот-СебестоимостьОборот) КАК Прибыль ИЗ РегистрНакопления.ПродажиБУ.Обороты(&Начало,&Конец,,) СГРУППИРОВАТЬ ПО Номенклатура,Продано УПОРЯДОЧИТЬ ПО Номенклатура.Наименование,Продано.Наименование",П);
КонецФункции

Функция ПечатнаяФорма(Начало,Конец) Экспорт
    Данные=Сформировать(Начало,Конец);
    Возврат ОтчетыСервер.ПечатнаяФорма("bu_sales",Данные,Начало,Конец);
КонецФункции
