Процедура ОбработкаПроведения(Отказ, РежимПроведения)
Учет.НастроитьПланСчетов();
Движения.Хозрасчетный.Записывать = Истина;
Движения.Хозрасчетный.Очистить();
Для Каждого С Из Проводки Цикл
 Д = Учет.Проводка(ЭтотОбъект, С.СчетДт, С.СчетКт, С.Сумма);
 Для Каждого Сторона Из СтрРазделить("Дт;Кт", ";") Цикл
    Счет = С["Счет" + Сторона]; Значение1 = С["Субконто" + Сторона + "1"]; Значение2 = С["Субконто" + Сторона + "2"];
    Если Не ЗначениеЗаполнено(Значение1) И Не ЗначениеЗаполнено(Значение2) Тогда
        Если Счет = ПланыСчетов.Управленческий.ПрибылиУбытки Тогда
            Значение1 = ?(ЗначениеЗаполнено(С.НоменклатураДт), С.НоменклатураДт, С.НоменклатураКт);
            Значение2 = ?(ЗначениеЗаполнено(С.НоменклатураКт), С.НоменклатураКт, С.НоменклатураДт);
        Иначе
            Значение1 = С["Номенклатура" + Сторона]; Значение2 = С["Склад" + Сторона];
        КонецЕсли;
    КонецЕсли;
    Учет.ЗаполнитьСубконто(Д, Счет, Сторона, Значение1, Значение2);
 КонецЦикла;
 Д.КоличествоДт = С.КоличествоДт; Д.КоличествоКт = С.КоличествоКт;
КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    Учет.ПроверитьОстаткиПриОтмене(ЭтотОбъект);
КонецПроцедуры
