Функция СформироватьТаблицу(Начало, Конец, Подразделение) Экспорт
    Возврат УчетСервер.ТаблицаЗапроса("ВЫБРАТЬ Номенклатура, Свойство КАК Характеристика,
    |СУММА(КоличествоНачальныйОстаток) КАК НачКоличество, СУММА(КоличествоПриход) КАК ПриходКоличество,
    |СУММА(КоличествоРасход) КАК РасходКоличество, СУММА(КоличествоКонечныйОстаток) КАК КонКоличество,
    |СУММА(СтоимостьНачальныйОстаток) КАК НачОстаток, СУММА(СтоимостьПриход) КАК Приход,
    |СУММА(СтоимостьРасход) КАК Расход, СУММА(СтоимостьКонечныйОстаток) КАК КонОстаток
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение)
    |СГРУППИРОВАТЬ ПО Номенклатура, Свойство", Новый Структура("Начало, Конец, Подразделение", Начало, Конец, Подразделение));
КонецФункции
