Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Попытка
        РасчетЗарплаты.Провести(ЭтотОбъект);
    Исключение
        Отказ = Истина;
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = ОписаниеОшибки();
        Сообщение.Сообщить();
    КонецПопытки;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    Блокировка = Новый БлокировкаДанных;
    Блокировка.Добавить("РегистрРасчета.Начисления").Режим = РежимБлокировкиДанных.Исключительный;
    Блокировка.Заблокировать();
    РасчетЗарплаты.РассчитатьСВытесненнымиЗаписями(Движения.Начисления, Ссылка, Истина);
КонецПроцедуры
