Функция Сформировать(Начало, Конец) Экспорт

Возврат Учет.ЗапросТаблица("ВЫБРАТЬ ВЫБОР КОГДА ЗаказаннаяНоменклатура=ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА НоменклатураКт ИНАЧЕ ЗаказаннаяНоменклатура КОНЕЦ КАК Номенклатура,
|НоменклатураКт КАК Продано, СУММА(КоличествоКт) КАК Количество, СУММА(Сумма) КАК Себестоимость, СУММА(Выручка) КАК Выручка, СУММА(Выручка-Сумма) КАК Прибыль
|ИЗ РегистрБухгалтерии.Хозрасчетный ГДЕ Активность И Период МЕЖДУ &Начало И &Конец И СчетДт=ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибылиУбытки) И СчетКт=ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Товары)
|СГРУППИРОВАТЬ ПО ЗаказаннаяНоменклатура,НоменклатураКт УПОРЯДОЧИТЬ ПО Номенклатура,Продано",Новый Структура("Начало,Конец",Начало,КонецДня(Конец)));
КонецФункции
