Функция Сформировать(Знач НачалоПериода, Знач КонецПериода, Знач Подразделение) Экспорт
    Возврат Учет.ЗапросТаблица("ВЫБРАТЬ Остатки.Номенклатура, Остатки.Свойство,
    | ЕСТЬNULL(Значения.Значение, Остатки.Свойство.Наименование) КАК Производитель,
    | СУММА(Остатки.КоличествоНачальныйОстаток) КАК НачКоличество,
    | СУММА(Остатки.КоличествоПриход) КАК ПриходКоличество,
    | СУММА(Остатки.КоличествоРасход) КАК РасходКоличество,
    | СУММА(Остатки.КоличествоКонечныйОстаток) КАК КонКоличество,
    | СУММА(Остатки.СуммаНачальныйОстаток) КАК НачСумма,
    | СУММА(Остатки.СуммаПриход) КАК ПриходСумма,
    | СУММА(Остатки.СуммаРасход) КАК РасходСумма,
    | СУММА(Остатки.СуммаКонечныйОстаток) КАК КонСумма
    | ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК Остатки
    | ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК Значения
    | ПО Остатки.Свойство = Значения.Свойство И Значения.Характеристика.Наименование = ""Производитель""
    | СГРУППИРОВАТЬ ПО Остатки.Номенклатура, Остатки.Свойство, ЕСТЬNULL(Значения.Значение, Остатки.Свойство.Наименование)
    | УПОРЯДОЧИТЬ ПО Производитель, Остатки.Номенклатура", Новый Структура("Начало,Конец,Подразделение", НачалоДня(НачалоПериода), КонецДня(КонецПериода), Подразделение));
КонецФункции
