Процедура ОбработкаПроведения(Отказ,РежимПроведения)
    УчетСервер.НастроитьСчета();
    УчетСервер.Блокировка("РегистрБухгалтерии.УправленческийУчет");
    Движения.УправленческийУчет.Записывать=Истина;
    Движения.ПродажиБУ.Записывать=Истина;
    Для Каждого С Из Проводки Цикл
        Если Не ЗначениеЗаполнено(С.СчетДт) Или Не ЗначениеЗаполнено(С.СчетКт) Тогда УчетСервер.Ошибка("Укажите оба счета проводки.",Отказ);Возврат;КонецЕсли;
        Д=Движения.УправленческийУчет.Добавить();Д.Период=Дата;ЗаполнитьЗначенияСвойств(Д,С);
        Если С.СчетДт=ПланыСчетов.Управленческий.Товары Тогда Д.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады]=С.СкладДт;КонецЕсли;
        Если С.СчетКт=ПланыСчетов.Управленческий.Товары Тогда Д.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады]=С.СкладКт;КонецЕсли;
        Если С.СчетКт=ПланыСчетов.Управленческий.Товары И С.СчетДт=ПланыСчетов.Управленческий.ПрибылиУбытки Тогда
            Р=Движения.ПродажиБУ.Добавить();Р.Период=Дата;Р.Номенклатура=С.НоменклатураКт;Р.Продано=С.НоменклатураКт;Р.Количество=С.КоличествоКт;Р.Себестоимость=С.Сумма;
        КонецЕсли;
        Если С.СчетДт=ПланыСчетов.Управленческий.Покупатели И С.СчетКт=ПланыСчетов.Управленческий.ПрибылиУбытки Тогда
            Р=Движения.ПродажиБУ.Добавить();Р.Период=Дата;Р.Номенклатура=С.НоменклатураКт;Р.Продано=С.НоменклатураКт;Р.Выручка=С.Сумма;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры
