&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса()); КонецПериода = КонецМесяца(НачалоПериода);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Данные = Отчеты.ПродажиОУ.СформироватьТаблицу(НачалоДня(НачалоПериода), КонецДня(КонецПериода));
    Результат = УчетСервер.ТабличныйОтчет(Данные, "ПродажиОУ", НачалоПериода, КонецПериода);
КонецПроцедуры
