Функция Сформировать(Начало, Конец) Экспорт
Начало=НачалоМесяца(Начало); Конец=КонецМесяца(Начало);
Возврат Учет.ЗапросТаблица("ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент, СУММА(Результат) КАК Сумма
|ИЗ РегистрРасчета.Начисления ГДЕ Активность И ПериодДействияНачало МЕЖДУ &Начало И &Конец И ВидРасчета=ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Премия)
|СГРУППИРОВАТЬ ПО Сотрудник УПОРЯДОЧИТЬ ПО Сотрудник",Новый Структура("Начало,Конец",Начало,КонецДня(Конец)));
КонецФункции
