&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДата()); КонецПериода = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Если НачалоПериода > КонецПериода Тогда ВызватьИсключение "Начало периода позже окончания."; КонецЕсли;
    Данные = Отчеты.ПремииСотрудников.СформироватьДанные(НачалоПериода, КонецПериода);
    Заголовок = "Месяц: " + Формат(НачалоПериода, "ДФ='MMMM yyyy'");
    Результат = ОтчетыСервер.ПредставитьОтчет(Данные, Заголовок, "Премии");
КонецПроцедуры
