Функция Сформировать(Знач НачалоПериода, Знач КонецПериода) Экспорт
    Возврат Учет.ЗапросТаблица("ВЫБРАТЬ Номенклатура, СУММА(КоличествоОборот) КАК Количество,
    | СУММА(СебестоимостьОборот) КАК Себестоимость, СУММА(ВыручкаОборот) КАК Выручка,
    | СУММА(ВыручкаОборот - СебестоимостьОборот) КАК Прибыль
    | ИЗ РегистрНакопления.Продажи.Обороты(&Начало, &Конец, , )
    | СГРУППИРОВАТЬ ПО Номенклатура", Новый Структура("Начало,Конец", НачалоДня(НачалоПериода), КонецДня(КонецПериода)));
КонецФункции
